# Importing MySQL in python

In [1]:
import MySQLdb
import pandas as pd

In [13]:
db = MySQLdb.connect(host="localhost",    # your host, usually localhost
                     user="root",         # your username
                     passwd="workshop",   # your mysql password
                     db="test")           # name of the data base

In [14]:
cur = db.cursor()

In [16]:
#Creating a table

numrow=cur.execute('CREATE TABLE STUDENTS\
        (RollNo INT,\
         Name VARCHAR(20),\
         Marks INT);')

OperationalError: (1050, "Table 'students' already exists")

In [17]:
#Inserting data into students table

cur.execute("INSERT INTO STUDENTS VALUES (1, 'Aashna', 89);")
cur.execute("INSERT INTO STUDENTS VALUES (2, 'Abhinav', 85);")
cur.execute("INSERT INTO STUDENTS VALUES (3, 'Ayesha', 78);")

1

In [18]:
db.commit()

In [21]:
numrow=cur.execute("SELECT * FROM Students")

In [22]:
cur.fetchall()

((1, 'Aashna', 89), (2, 'Abhinav', 85), (3, 'Ayesha', 78))

In [8]:
numrow=cur.execute("SELECT * FROM Students where marks>80")

In [9]:
cur.fetchall()

((1, 'Aashna', 83), (3, 'Ayesha', 85), (6, 'Tanishka', 81))

In [10]:
numrow=cur.execute("SELECT * FROM Students where Name='Ayesha'")

In [11]:
cur.fetchall()

((3, 'Ayesha', 85),)

# Inserting data from a CSV file to a SQL Table

In [11]:
data=[]

In [12]:
import csv

with open('Desktop/Student.csv', 'r') as csvFile:
    reader = csv.reader(csvFile)
    for row in reader:
        data.append(row)

In [13]:
data

[['4', 'Ajay', '70'],
 ['5', 'Somnath', '75'],
 ['6', 'Tanishka', '81'],
 ['7', 'Vishal', '65']]

In [18]:
for row in data:
    sql = "insert into Students VALUES("+row[0]+",'"+row[1]+"',"+row[2]+")"
    numrow=cur.execute(sql)

In [19]:
db.commit()

In [15]:
numrow=cur.execute("SELECT * FROM Students")

In [16]:
Student=cur.fetchall()

In [17]:
Student

((1, 'Aashna', 83),
 (2, 'Abhinav', 80),
 (3, 'Ayesha', 85),
 (4, 'Ajay', 70),
 (5, 'Somnath', 75),
 (6, 'Tanishka', 81),
 (7, 'Vishal', 65))

# Reading SQL table into a Dataframe

In [23]:
df = pd.read_sql('SELECT * FROM students', con=db)

In [24]:
df

   RollNo     Name  Marks
0       1   Aashna     89
1       2  Abhinav     85
2       3   Ayesha     78

In [12]:
db.close()